# 第１１章：点推定
# 点推定には２つの方法がある ---> 最尤推定と不偏推定


# 11.2 最尤推定法(maximum likelihood method)
# 前提：確率分布が分かっていて、そのパラメータを知りたい時に適用できる
# 最尤推定 MASSライブラリのfitdistrd
# 現実のサンプルは確率最大のものが実現したと考える。---> 最尤原理
# ΠP(X=xi)を対数化した∑logP(X=xi)を微分を取って０と置いたときのパラメータについて解く
# 対数をとる理由 ---> 積の形の微分方程式は複雑で対数を取って和にした方が簡単
# 何で微分係数が０をとると極値を持つことしか言えないのでは？ ---> 統計の分布は最大値を極値に持つものばかりだからオッケー
?fitdistr
x <- rweibull(1000000, shape=8, scale=3)
fitdistr(x, "weibull")
# warningが出るが気にしなくていい
# かっこの中は推定標準偏差
hist(x, prob=TRUE)
curve(dweibull(x,shape=8,scale=3), add=TRUE)
# 密度関数とよくフィッティングしている。


# 第１３章：区間推定
# 13.1 大標本における区間推定
# 信頼区間 ---> 「母平均µがこの区間にある」と言えば95%の確率で正解であると言える
# 注意：母平均µがこの区間に収まる確率が95%であるということはできない ---> ベイズ
# µ: xbar ±1.96sd(x)/sqrt(n)
# 上記は小標本の時は誤差が大きく実用上問題となる。

# 13.2 小標本に対するt分布の応用
# ウィリアム シーリー ゴセット(studentというペンネームで論文を執筆していた)
# Rには実は信頼区間のみを個別に計算する関数はない。
# 有意差検定で使うt検定を行えば信頼区間も一緒に出力されるのでそれを使うのが一般的
# t.test(データオブジェクト名, mu=検定する値)　mu指定なしでも良い（mu=0）
# というかt分布は極限として正規分布を含むのでCIを求める際は全てt分布で良い
data <- c(1,2,2,2,3,3,4,4,7,8,9)
t.test(data)
# 95% ---> 99% CI
t.test(data, conf.level = 0.99)

# CIのVisualization
n <- 30
plot(c(0,n), c(35,65), type="n", axes=FALSE, xlab="", ylab="")
axis(1)
abline(h=50)
y1 <- y2 <- numeric(n)
for (i in 1:n){
  y <- rnorm(10, 50, 10)           # sample sizeをいじるとCIの幅が変わるよ
  y1[i] <- t.test(y, conf.level = 0.95)$conf.int[1]
  y2[i] <- t.test(y, conf.level = 0.95)$conf.int[2]
  segments(i,y1[i], i, y2[i], lwd=2)
  
}










