# 第１１章：点推定
# 点推定には２つの方法がある ---> 最尤推定と不偏推定


# 11.2 最尤推定法(maximum likelihood method)
# 前提：確率分布が分かっていて、そのパラメータを知りたい時に適用できる
# 最尤推定 MASSライブラリのfitdistrd
# 現実のサンプルは確率最大のものが実現したと考える。---> 最尤原理
# ΠP(X=xi)を対数化した∑logP(X=xi)を微分を取って０と置いたときのパラメータについて解く
# 対数をとる理由 ---> 積の形の微分方程式は複雑で対数を取って和にした方が簡単
# 何で微分係数が０をとると極値を持つことしか言えないのでは？ ---> 統計の分布は最大値を極値に持つものばかりだからオッケー
?fitdistr
x <- rweibull(1000000, shape=8, scale=3)
fitdistr(x, "weibull")
# warningが出るが気にしなくていい
# かっこの中は推定標準偏差
hist(x, prob=TRUE)
curve(dweibull(x,shape=8,scale=3), add=TRUE)
# 密度関数とよくフィッティングしている。


# 第１３章：区間推定
# 13.1 大標本における区間推定
# 信頼区間 ---> 「母平均µがこの区間にある」と言えば95%の確率で正解であると言える
# 注意：母平均µがこの区間に収まる確率が95%であるということはできない ---> ベイズ
# µ: xbar ±1.96sd(x)/sqrt(n)
# 上記は小標本の時は誤差が大きく実用上問題となる。


# 13.2 小標本に対するt分布の応用
# ウィリアム シーリー ゴセット(studentというペンネームで論文を執筆していた)
# Rには実は信頼区間のみを個別に計算する関数はない。
# 有意差検定で使うt検定を行えば信頼区間も一緒に出力されるのでそれを使うのが一般的
# t.test(データオブジェクト名, mu=検定する値)　mu指定なしでも良い（mu=0）
# というかt分布は極限として正規分布を含むのでCIを求める際は全てt分布で良い
data <- c(1,2,2,2,3,3,4,4,7,8,9)
t.test(data)
# 95% ---> 99% CI
t.test(data, conf.level = 0.99)

# CIのVisualization
n <- 30
plot(c(0,n), c(35,65), type="n", axes=FALSE, xlab="", ylab="")
axis(1)
abline(h=50)
y1 <- y2 <- numeric(n)
for (i in 1:n){
  y <- rnorm(10, 50, 10)           # sample sizeをいじるとCIの幅が変わるよ
  y1[i] <- t.test(y, conf.level = 0.95)$conf.int[1]
  y2[i] <- t.test(y, conf.level = 0.95)$conf.int[2]
  segments(i,y1[i], i, y2[i], lwd=2)
  
}

# 不偏推定
# 不偏推定量：推定値の期待値をとるとそれが真のパラメータをとる推定量(estimator)
# 　---> 標本平均

# 不偏分散
# 分散は不偏推定量ではない ---> デルタ自由度をn-1とした不偏分散を不偏推定量とする
# 平均10, 分散25の正規乱数のベクトルxを作り10000行10列の行列xmに変換する
# 真の分散より標本分散の平均の方が小さい ---> 真の分散を過小評価する
x <- rnorm(100000, 10, 5)
xm <- matrix(x, nrow=10000, ncol=10)
unbiased_var <- apply(xm,1,sd)
unbiased_var
biased_var <- (9/10)*unbiased_var
hist(biased_var,
     nclass=30)
abline(v=25,lwd=2)
abline(v=mean(biased_var),
       lwd=2,
       lty="dashed")
# 分母をn-1にして過小評価を修正することで不偏推定量となる
# ただし不偏分散の標準偏差は不偏推定量ではないことに注意

# 正規分布とt分布のズレ
# 古典的な統計学教育ではサンプルサイズnが２５以下の標本を小標本とし
# これより大きいサンプルを大標本とした。
# 大標本の場合は正規分布で小標本のときはt分布を使うとすることが多かった。（私もそう習った）
# しかしt分布は極値として正規分布を含むので信頼区間を求める際は全てt分布で考えればよい。
# 統計ソフトがない時代には付表を使っていたため上記のような区別を行っていただけ
# 正規分布とt分布の97.5%点を見てみよう

qt(0.975, 1:30)  # t分布の97.5%点, df=1:30
qnorm(0.975)     # 正規分布の97.5%点

qt(0.975, 99)    # n=100
qt(0.975, 999)   # n=1000

degf <- 10:200
qtf <- qt(0.975, degf)
plot(degf, qtf, type="l", ylim=c(1.9, 2.25))
abline(h=qnorm(0.975))
# 常に戦記分布のパーセント点がt分布のそれより小さいことがわかる
# したがって正規分布では信頼区間を狭く見積もってしまう甘い見積もりになる。
# 正規分布を用いた信頼区間は統計ソフトがない環境でやむなく使う物。


# 13.4 なんでt分布が出てくるの？（おさらい）
# 正規母集団N(µ, sigma^2)からランダムサンプリングしたデータXnに対し
# Xnを標準化したZを考えるとZ = (Xbar - µ)/(sigma/sqrt(n)) でZが標準正規分布に従う
# ことを利用してµの信頼区間を出せた。
# でもsigmaって普通は未知だからZはそのままではつかえないよね？
#  ---> sigmaの推定値を使えば良い！
# sigmaの不偏推定量である不偏分散を使ったZ値はt分布に従うからZをt値と言い換えた。


# 14章：統計的仮説検定
# おさらい
# 1.帰無仮説H0の設定
# 2.対立仮説H1の設定
# 3.有意水準åの設定(Default:95)
# 4.統計検定量の選択と計算
# 5.p-valueがå以下であった場合t値はH0の元では偶然では起こり得ないであり、整合性が取れない。H0を棄却する。
# 6.p-valueがå以上の場合、t値はH0と整合性が取れる値でありH0は棄却されない。
# 本質：仮説を棄却するかどうかというのはt値が信頼区間を外れているかどうかを見ているにすぎない。
sugar <- c(10.2,10.0,9.9,9.8,10.1)
t.test(sugar, mu=10.5)

# 14.2 検定の帰結
# 検定は統計的な処理なためたまに間違える。
# 第一種の誤り：有意な差がないのにH0を棄却してしまう。確率は有意水準の値。(Default:å=0.05)
# 第二種の誤り：有意な差があるのにそれを見逃す。検出力。
#  ---> 第二種の誤りはサンプル数に依存する。例数設計。

# 番外編：Rで例数設計(http://nfunao.web.fc2.com/files/R-intro/R-stat-intro_18.pdf)
# t検定（２標本の差の検定）の検出力を計算する
# 検出力は慣習的に80%を目標とする。
# 1.サンプルサイズを基準として検出力を求める時。
power.t.test(n=100,
             delta=1.0,
             sd=2.5)

# 2.検出力を基準にサンプルサイズを求める時
# 検証の前段階で使う場合はこちらでサンプルサイズの設計を行える。
# delta: 想定した平均値の差(default=0).
# deltaには許容できる差の最大値を入れるとその条件での最小のサンプルサイズが算出できる。
# 例数設計とは「効果の差」を設定し、予想されるデータのばらつき、有意水準、検出力の
# 元で有意差を見出せる例数を算出すること。
power.t.test(power=0.8,　　# 検出力80%
             delta=1.0,
             sd=2.5)


# 14.4 対応のある２標本の平均値の比較
# 同一のサンプルに対する事前事後比較のようなケース
# H0: before - after = 0
# H1: before > after
before <- c(18,12,16,15,20)  　　# 処理前
after <- c(15,13,14,11,17)   　　# 処理後
t.test(before,after,
       paired=TRUE,          　　# 対応ありの引数
       alternative="greater")    # 片側検定


# 14.5 対応のない２標本の平均値差の検定（Welch's t-test）
# 古典的検定：等分散かどうかの検定をして結果に応じた手法で差の検定を行っていた。
#  ---> 2重検定となってしまう＋等分散が棄却されなかった場合、等分散であることが指示されたわけではない
#  ---> ベーレンス・フィッシャー問題（数理統計学の歴史上重要な問題）
# 最新の方法：初めから等分散を仮定しないWelchの検定を適用する。
men <- c(79,56,91,60,51,82)
woman <- c(97,66, 83, 75, 53)
t.test(men, woman)      # t.test()で２標本の場合DefaultでWelchが選択される


# 14.6 効果量について
# 検定は平均値差がとても小さい場合でも偶然ではおき得ない差の場合有意になる
# でも有意な差でも性能に影響する差が無視できるならあまり意味のある差ではない
# ---> 効果量に着目。有意差が出ましたで終わらないように。
# Cohen "The primary product of a research inquiry is one or more measures of effect size, not P-values."
# 検定統計量：効果量 * 標本の大きさ

# Cohen's d : (y1bar - y2bar)/標準誤差（サンプルを変えるごとに発生する誤差） ---> 標準化された平均値差（測定単位に依らない）
# 研究によっては非標準化効果量の方が解釈が簡単な物もあるため、併せて報告することも検討して良い
x <- rnorm(100, 50, 10)
y <- rnorm(100, 55, 15)
cohen.d(x, y)

# Cohen's dはやや正確性に欠けるためこれを修正したHedges' gを使っても良い
cohen.d(x, y,
        hedges.correction = TRUE)  # Hedges' g

# Cliff's delta : ノンパラメトリック検定で用いる
  # ノンパラメトリック検定：正規性を確認せずに使える(どんな分布でも使える)。
  # ---> Mann-Whitney's U-test (Wilcoxonの順位和検定も方法は同じ)
  # パラメトリック検定：データの正規性が前提。解釈しやすい。有意差を出しやすい。
  # ---> t-test
# ノンパラメトリック検定であればどんな検定でもCliff's deltaで効果量が出せる。(Cohen's dのようなのもの)
x <- rpois(1000,2)
y <- rpois(1000,2.5)
cliff.delta(x, y)
# ノンパラメトリック検定を基本的に使い、例数設計を行う際にはt検定を使うというのが常套手段


# 第１５章：べき分布
# 確率密度関数f(x)=cx^-å のものをべき分布またはパレート分布(Pareto dist.)という。
# 地震のマグニチュードMと地震が発するエネルギーEの関係は
# ---> log10E = 4.8 + 1.5M
# M: magnitude, N: 地震の回数
M <- scan(pipe("pbpaste"))
N <- scan(pipe("pbpaste"))
plot(M, log10(N))
res <- lm(log10(N)~M)
summary(res)
abline(res)
# log10(N) ~ 7.211 - 0.873M ---> Mが１大きくなると地震の頻度は10^(-0.8730)落ちる（ほぼ７から８分の１）
# 上記はN ~ 10^(7.21)*10^(-0.8730M) と書ける。---> Mに関しては指数ぶんぷとなっている
# また　log10N ~ 10.004555 - 0.87303log10Eを対数を外すと
# べき分布 N = f(E) = 10^(10.00455)*E^(-0.87303)が得られる
# 地震の回数とエネルギーの関係のような log10N = a - bM <--- GR則（Gutenberg-Richter law)という。
# GR則：N = f(E) = 10^(a)*E^(-b) にはスケール・フリー則が成り立つ。（定数倍してもいい）
# これは地震の規模によらず同じメカニズムで発生しているらしいということである。


# 15.2 ファットテイルを持つ分布
# 平均から外れた部分（テイル）を考える。平均からx以上離れている確率は
# 正規分布：Pnorm(|X|>=x) = Ce^(-x^(2)/4) ---> 正規分布は遠方でガウス型減衰する:猛烈な勢いで小さくなっていく
# 指数分布：Pexo(|X|>=x) = e^(-x)         ---> 指数分布では指数型減衰する：小さくなるスピードはそんなに早くない
# コーシー分布：Pcauchy(|X|>=x) = Cx^(-1) ---> コーシー分布ではべき型減衰する：テイル部分がなかなか小さくならない
# x^(-γ)のように減衰する場合、γをパレート指数という。


# 15.2.1 べき分布の詳細な定義
# 詳細の理解は断念。要するに外れ値が発生することが珍しくない分布（べき分布）があり
# 例えば地震や株価の大変動のように、大抵の日は穏やかななのに突然大混乱を引き起こすような
# 巨大な大変動が生ずることを示している
# 筆者がわざわざべき分布に言及したのは「ブラック・スワン」の著者が言った次の言葉を言いたかったからw
# ファットテイルが支配する世界を「果ての国」とよび正規分布が支配する世界を「月並みの国」と呼んだ。
# 我々は平穏な世界に住んでいると錯覚する。実際は果ての国なのに。ー終わりー












